### 7.1 Handling Missing Data
 - uses the floating-point value NaN (Not a Number) to represent missing data. 
 - We call this a sentinel value

In [4]:
import pandas as pd
import numpy as np

string_data= pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
#boolean array
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0] = None
string_data

0         None
1    artichoke
2          NaN
3      avocado
dtype: object

In [7]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

### List of NA handling methods
- dropna
- fillna with additional method 'ffill' or 'bfill'
- isnull
- notnull

### Filtering Out Missing Data

In [9]:
from numpy import nan as NA
data=pd.Series([1, NA, 3.5, NA, 7])

data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [10]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                    [NA, NA, NA], [NA, 6.5, 3.]])

cleaned = data.dropna()

data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [12]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [13]:
#Passing how='all' will only drop rows that are all NA:

data.dropna(how ='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [14]:
# To drop columns in the same way, pass axis=1

data[4] = NA

data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [15]:
data.dropna(axis=1, how='all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [16]:
# to keep rows with certain no of observations
# indicate with the thresh argument

df = pd.DataFrame(np.random.randn(7,3))
df.iloc[:4, 1] = NA
df.iloc[:2, 2] = NA

df

          0         1         2
0 -0.420959       NaN       NaN
1 -0.150838       NaN       NaN
2  0.575425       NaN -0.458436
3  0.365586       NaN -0.242019
4  0.279866 -0.947468 -1.089297
5 -1.529633 -2.069911 -0.252697
6  0.770427 -0.128230 -1.336824

In [17]:
df.dropna()
#will drop no matter how many NaN

          0         1         2
4  0.279866 -0.947468 -1.089297
5 -1.529633 -2.069911 -0.252697
6  0.770427 -0.128230 -1.336824

In [18]:
df.dropna(thresh = 2)

          0         1         2
2  0.575425       NaN -0.458436
3  0.365586       NaN -0.242019
4  0.279866 -0.947468 -1.089297
5 -1.529633 -2.069911 -0.252697
6  0.770427 -0.128230 -1.336824

### Filling in Missing Data
- calling fillna with a constant

#### fillna function arguments
- value
- method
- axis
- inplace
- limit

In [20]:
df.fillna(0)

          0         1         2
0 -0.420959  0.000000  0.000000
1 -0.150838  0.000000  0.000000
2  0.575425  0.000000 -0.458436
3  0.365586  0.000000 -0.242019
4  0.279866 -0.947468 -1.089297
5 -1.529633 -2.069911 -0.252697
6  0.770427 -0.128230 -1.336824

In [21]:
# fillna with a dict
# use different fill value for each column

df.fillna({1: 0.5, 2: 0})

          0         1         2
0 -0.420959  0.500000  0.000000
1 -0.150838  0.500000  0.000000
2  0.575425  0.500000 -0.458436
3  0.365586  0.500000 -0.242019
4  0.279866 -0.947468 -1.089297
5 -1.529633 -2.069911 -0.252697
6  0.770427 -0.128230 -1.336824

In [22]:
# use inplace = True to modify exisitng object

df.fillna(0, inplace=True)

df

          0         1         2
0 -0.420959  0.000000  0.000000
1 -0.150838  0.000000  0.000000
2  0.575425  0.000000 -0.458436
3  0.365586  0.000000 -0.242019
4  0.279866 -0.947468 -1.089297
5 -1.529633 -2.069911 -0.252697
6  0.770427 -0.128230 -1.336824

In [23]:
# reindexing can be used with fillna

df = pd.DataFrame(np.random.randn(6,3))
df.iloc[2:, 1] = NA
df.iloc[4:, 2] = NA

df

          0         1         2
0 -1.271318 -0.328773  0.965053
1 -0.484016 -0.849148  0.562919
2 -0.813308       NaN -0.766102
3  0.058327       NaN -0.540617
4  0.656271       NaN       NaN
5 -2.496085       NaN       NaN

In [24]:
df.fillna(method ='ffill')

          0         1         2
0 -1.271318 -0.328773  0.965053
1 -0.484016 -0.849148  0.562919
2 -0.813308 -0.849148 -0.766102
3  0.058327 -0.849148 -0.540617
4  0.656271 -0.849148 -0.540617
5 -2.496085 -0.849148 -0.540617

In [25]:
df.fillna(method ='ffill', limit =2)

          0         1         2
0 -1.271318 -0.328773  0.965053
1 -0.484016 -0.849148  0.562919
2 -0.813308 -0.849148 -0.766102
3  0.058327 -0.849148 -0.540617
4  0.656271       NaN -0.540617
5 -2.496085       NaN -0.540617

In [26]:
# can fill with mean or median of value in the Series

data = pd.Series([1., NA, 3.5, NA, 7])
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

### 7.2 Data Transformation
- filtering
- cleaning 
- other transformations

#### Removing Duplicates
- Duplicate rows can be found in DataFrame

In [27]:
data = pd.DataFrame({'k1':['one', 'two']* 3 + ['two'],
                    'k2':[1, 1, 2, 3, 3, 4, 4]})

data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [28]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [29]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [30]:
data['v1'] = range(7)

data

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
5  two   4   5
6  two   4   6

In [31]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [32]:
data.drop_duplicates(['k1', 'k2'], keep='last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

### Transforming Data using A Function or Mapping

In [33]:
data = pd.DataFrame({'food': ['bacon', 'pulled pork', 'bacon',
                             'Pastrami', 'corned beef', 'Bacon',
                             'pastrami', 'honey ham', 'nova lox'],
                     'ounces': [4, 3, 12, 6, 7.5, 8, 3, 5, 6]})

data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [34]:
# create a new column
#  try to map the meat comes from which animal

meat_to_animal = {
    'bacon': 'pig',
    'pulled pork': 'pig',
    'pastrami': 'cow',
    'corned beef': 'cow',
    'honey ham': 'pig',
    'nova lox': 'salmon'
}

In [35]:
# use map method

lowercased = data['food'].str.lower()

lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [37]:
#add new column that is mapped

data['animal'] = lowercased.map(meat_to_animal)

data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [38]:
# alternative method
# pass a function to do the work

data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

### Replacing Values

- fill the missing data with fillna

In [39]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [40]:
data.replace( -999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [41]:
# replace multiple values at once

data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

### Renaming Axis Indexes
- map method
- rename method

In [1]:
import numpy as np
import pandas as pd

data = pd.DataFrame(np.arange(12).reshape((3,4)),
                   index = ['Ohio', 'Colorado', 'New York'],
                   columns = ['one', 'two', 'three', 'four'])

data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
New York    8    9     10    11

In [2]:
#upper capslock for first 4 letters in the index

transform = lambda x: x[:4].upper()

data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [3]:
data.index = data.index.map(transform)

data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [4]:
## use rename on the index and columns

data.rename(index=str.title, columns=str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [5]:
data.rename(index={'OHIO': 'INDIANA'},
            columns ={'three':'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [6]:
# permanently change using inplace = True

data.rename(index={'OHIO':'INDIANA'}, inplace=True)

data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

### Discretization and Binnig

Continuous data is separated into 'bins' for analysis

In [7]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

bins = [18, 25, 35, 60, 100]

cats = pd.cut(ages, bins)

cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

- this returns a special Categorical object
- describes the bins computed by pandas.cut

In [8]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [9]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [10]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [11]:
#change the bin and decide which side is closed by passing right = False

pd.cut(ages, [18, 26, 36, 61, 100], right=False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [12]:
# pass your own bin names by passing a list or array to labels option

group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']
pd.cut(ages, bins, labels= group_names)

[Youth, Youth, Youth, YoungAdult, Youth, ..., YoungAdult, Senior, MiddleAged, MiddleAged, YoungAdult]
Length: 12
Categories (4, object): [Youth < YoungAdult < MiddleAged < Senior]

In [13]:
# pass an integer number of bins to cut instead of explicit bin edges
# it will compute equal-length bins on min & mac values

data = np.random.rand(20)

data

array([0.07455465, 0.94803998, 0.50427383, 0.87731112, 0.19691261,
       0.12887242, 0.25151095, 0.6748375 , 0.81360811, 0.66468254,
       0.82236101, 0.50466581, 0.84915111, 0.46302134, 0.46085382,
       0.04349957, 0.66139211, 0.15654082, 0.56343667, 0.51989138])

In [14]:
# precision = 2, means decimal place = 2

pd.cut(data, 4, precision=2)

[(0.043, 0.27], (0.72, 0.95], (0.5, 0.72], (0.72, 0.95], (0.043, 0.27], ..., (0.043, 0.27], (0.5, 0.72], (0.043, 0.27], (0.5, 0.72], (0.5, 0.72]]
Length: 20
Categories (4, interval[float64]): [(0.043, 0.27] < (0.27, 0.5] < (0.5, 0.72] < (0.72, 0.95]]

In [15]:
# qcut uses sample quantiles, to obtain equal sized bins

data = np.random.rand(1000) #Normally distributed
cats = pd.qcut(data, 4) # Cut into quartiles

cats

[(0.755, 1.0], (0.755, 1.0], (0.254, 0.52], (-0.000888, 0.254], (0.52, 0.755], ..., (-0.000888, 0.254], (-0.000888, 0.254], (0.755, 1.0], (0.254, 0.52], (0.254, 0.52]]
Length: 1000
Categories (4, interval[float64]): [(-0.000888, 0.254] < (0.254, 0.52] < (0.52, 0.755] < (0.755, 1.0]]

In [16]:
pd.value_counts(cats)

(0.755, 1.0]          250
(0.52, 0.755]         250
(0.254, 0.52]         250
(-0.000888, 0.254]    250
dtype: int64

In [17]:
# pass my own quantiles between 0 & 1, inclusive

pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(0.52, 0.905], (0.905, 1.0], (0.0982, 0.52], (-0.000888, 0.0982], (0.52, 0.905], ..., (0.0982, 0.52], (0.0982, 0.52], (0.52, 0.905], (0.0982, 0.52], (0.0982, 0.52]]
Length: 1000
Categories (4, interval[float64]): [(-0.000888, 0.0982] < (0.0982, 0.52] < (0.52, 0.905] < (0.905, 1.0]]

### Detection and Filtering Outliers
- filtering & transforming Outliers

In [18]:
data = pd.DataFrame(np.random.randn(1000, 4))

data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.016548     0.105779    -0.038824    -0.035552
std       0.979340     1.024618     0.975242     0.979236
min      -3.423136    -3.354126    -2.969072    -2.700127
25%      -0.635197    -0.610235    -0.708752    -0.663112
50%       0.032400     0.110618    -0.055356    -0.030725
75%       0.640827     0.804982     0.659022     0.622398
max       2.723643     3.552167     3.614804     3.011905

In [19]:
col = data[2]

In [20]:
#find values in 1 columns exceeding 3 in absolute value

col[np.abs(col) > 3]

334    3.614804
Name: 2, dtype: float64

In [21]:
# to select rows having a value exceeding 3 or -3
# use any method on Boolean DataFrame

data[(np.abs(data) > 3).any(1)]

            0         1         2         3
56  -0.586804  3.110002 -1.985774 -1.148006
87  -3.423136 -0.131418 -0.552429  0.827774
195  1.165129  3.252001 -1.262606  0.523311
218 -0.748702 -3.007705 -1.346683 -0.306100
317  0.167646  3.552167  0.220022  0.851783
325 -0.418856  1.960311 -0.141104  3.011905
334  0.201937 -0.286214  3.614804 -0.402017
956  0.252715 -3.354126  0.270732 -1.107956

In [22]:
data[np.abs(data) > 3]= np.sign(data)*3

data.describe()

                 0            1            2            3
count  1000.000000  1000.000000  1000.000000  1000.000000
mean      0.016972     0.105226    -0.039439    -0.035564
std       0.977942     1.020681     0.973128     0.979199
min      -3.000000    -3.000000    -2.969072    -2.700127
25%      -0.635197    -0.610235    -0.708752    -0.663112
50%       0.032400     0.110618    -0.055356    -0.030725
75%       0.640827     0.804982     0.659022     0.622398
max       2.723643     3.000000     3.000000     3.000000

In [23]:
np.sign(data).head()

     0    1    2    3
0  1.0 -1.0 -1.0  1.0
1  1.0  1.0  1.0  1.0
2  1.0  1.0 -1.0 -1.0
3  1.0  1.0 -1.0  1.0
4  1.0  1.0  1.0  1.0

### Permutation and Random Sampling
- Permuting a series or rows in a DataFrame
- using numpy.random.permutation function
- permutation with length or axis produces new array

In [25]:
df = pd.DataFrame(np.arange(5*4).reshape((5,4)))

sampler = np.random.permutation(5)
sampler

array([4, 3, 2, 1, 0])

In [27]:
df.take(sampler)

    0   1   2   3
4  16  17  18  19
3  12  13  14  15
2   8   9  10  11
1   4   5   6   7
0   0   1   2   3

In [28]:
# To select a random subset withoit replacement
# use sample method on Series and DataFrame

df.sample(n=3)

    0   1   2   3
1   4   5   6   7
3  12  13  14  15
4  16  17  18  19

In [29]:
# To generate a sample with replacement(allow repeat choices)
# use replace = True

choices = pd.Series([5, 7, -1, 6, 4])
draws = choices.sample(n=10, replace = True)

draws

3    6
0    5
1    7
3    6
3    6
0    5
0    5
3    6
4    4
3    6
dtype: int64

### Computing Indicator/Dummy Variables
- conver the categorical variable into a 'dummy' or 'indicator' matrix
- get_dummies function

In [31]:
df=pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'],
                 'data1': range(6)})

pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [35]:
# merge with other data

dummies = pd.get_dummies(df['key'], prefix='key')

df_with_dummy = df[['data1']].join(dummies)

df_with_dummy

   data1  key_a  key_b  key_c
0      0      0      1      0
1      1      0      1      0
2      2      1      0      0
3      3      0      0      1
4      4      1      0      0
5      5      0      1      0

In [ ]:
mnames = ['movie_id', 'title', 'genres']

movies = pd.read_table('datasets/movielens/movies.dat', sep='::',
                        header=None, names = mnames)

movies[:10]

### String Manipulation

- use regular expressions
- apply string and regular expression concisely on whole arrays of data

### String Object Methods

In [41]:
val = 'a, b, guido'

val.split(',')

['a', ' b', ' guido']

In [42]:
pieces = [x.strip() for x in val.split(',')]

pieces

['a', 'b', 'guido']

In [43]:
# substrings could be concatenated together

first, second, third = pieces

first + '::' + second + '::' + third

'a::b::guido'

In [45]:
'::'.join(pieces)

'a::b::guido'

In [46]:
'guido' in val

True

In [47]:
val.index(',')

1

In [48]:
val.find(':')

-1

In [49]:
# index raises an exception if the string isnt found
val.index(':')

ValueError: substring not found

In [50]:
val.count(',')

2

In [51]:
val.replace(',', '::')

'a:: b:: guido'

In [52]:
val.replace(',', '')

'a b guido'

### Regular Expression
- built-in re module

In [53]:
import re

text = 'foo bar\t baz \tqux'
re.split('\s+', text)

['foo', 'bar', 'baz', 'qux']

In [54]:
regex = re.compile('\s+')

regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [55]:
regex.findall(text)

[' ', '\t ', ' \t']

In [57]:
text = """Dave dave@google.com
Steve steve@gmail.com
Rob rob@gmail.com
Ryan ryan@yahoo.com
"""

pattern = r'[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}'

# re.IGNORECASE makes the regex case - insensitive
regex = re.compile(pattern, flags=re.IGNORECASE)

In [58]:
# use findall to produce a list of email addresses

regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [59]:
#search - returns a special match object for the first email address

m = regex.search(text)
m

In [60]:
text[m.start():m.end()]

'dave@google.com'

In [61]:
# match() will only match if pattern occurs at start of the string
print(regex.match(text))

None

In [62]:
#.sub() will replace the pattern with new string

print(regex.sub('REDACTED', text))

Dave REDACTED
Steve REDACTED
Rob REDACTED
Ryan REDACTED

In [63]:
#want to find email addresses and simultaneously 
#split them into 3 components: username, domain name, domain suffix

pattern =  r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

regex = re.compile(pattern, flags=re.IGNORECASE)

# match object produced by modified regex returns a tuple of pattern components 
# with its groupd method

m = regex.match('wes@bright.net')

m.groups()

('wes', 'bright', 'net')

In [64]:
#findall returns a list of tuples when the pattern has groups

regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [65]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3', text))

Dave Username: dave, Domain: google, Suffix: com
Steve Username: steve, Domain: gmail, Suffix: com
Rob Username: rob, Domain: gmail, Suffix: com
Ryan Username: ryan, Domain: yahoo, Suffix: com

### Vectorized String Functions in pandas

In [66]:


data = {'Dave': 'dave@google.com',
        'Steve': 'steve@gmail.com',
        'Rob': 'rob@gmail.com',
        'Wes': np.nan}

data = pd.Series(data)

In [67]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [68]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [69]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [70]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [71]:
data.str.findall(pattern, flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [73]:
matches = data.str.match(pattern, flags = re.IGNORECASE)

matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [81]:
matches.str[0]

AttributeError: Can only use .str accessor with string values!

In [78]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object